create type tableType as table (i int, j int);
go

-- ROLLBACK should get unsupported error message
create proc p1 as
begin
	declare @tv tableType;
	begin tran insert @tv values (1,2);
	rollback;
	select * from @tv
end
go
exec p1
go
~~ROW COUNT: 1~~

~~START~~
int#!#int
1#!#2
~~END~~


-- ROLLBACK should get unsupported error message
declare @t table (a int)
begin tran
insert into @t values(1)
select @@rowcount as rows_inserted
rollback
select count(*) from @t
print 'after select'
go
~~ROW COUNT: 1~~

~~START~~
int
1
~~END~~

~~START~~
int
1
~~END~~


declare @tv1 tableType;
begin transaction
insert @tv1 values (1,2), (2,1);
select * from @tv1;
go
~~ROW COUNT: 2~~

~~START~~
int#!#int
1#!#2
2#!#1
~~END~~


-- ROLLBACK here is fine because @tv1 is out of scope
rollback
select * from @tv1;
go
~~ERROR (Code: 33557097)~~

~~ERROR (Message: relation "@tv1" does not exist)~~


-- ROLLBACK should get unsupported error message
declare @tv2 tableType;
begin transaction
insert @tv2 values (3,4), (4,3);
select * from @tv2;
rollback
select * from @tv2;
go
~~ROW COUNT: 2~~

~~START~~
int#!#int
3#!#4
4#!#3
~~END~~

~~START~~
int#!#int
3#!#4
4#!#3
~~END~~


-- cleanup
drop type tableType;
go
drop proc p1;
go
