CREATE TABLE DATETIME_dt (a DATETIME)
prepst#!# INSERT INTO DATETIME_dt(a) values(?) #!#DATETIME|-|a|-|2000-12-13 12:58:23.123
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.989
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.990
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.991
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.992
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.993
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.994
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.995
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.996
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.997
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.998
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|2000-02-28 23:59:59.999
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|1900-02-28 23:59:59.989
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|1753-01-01 00:00:00.000
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|9999-12-31 23:59:59.997
~~ROW COUNT: 1~~

prepst#!#exec#!#DATETIME|-|a|-|<NULL>
~~ROW COUNT: 1~~

SELECT * FROM DATETIME_dt;
~~START~~
datetime
2000-12-13 12:58:23.123
2000-02-28 23:59:59.99
2000-02-28 23:59:59.99
2000-02-28 23:59:59.99
2000-02-28 23:59:59.993
2000-02-28 23:59:59.993
2000-02-28 23:59:59.993
2000-02-28 23:59:59.997
2000-02-28 23:59:59.997
2000-02-28 23:59:59.997
2000-02-28 23:59:59.997
2000-02-29 00:00:00.0
1900-02-28 23:59:59.99
1753-01-01 00:00:00.0
9999-12-31 23:59:59.997
<NULL>
~~END~~

INSERT INTO DATETIME_dt(a) values('2000-12-13 12:58:23.123')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.989')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.990')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.991')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.992')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.993')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.994')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.995')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.996')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.997')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.998')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1900-02-28 23:59:59.999')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('2000-02-28 23:59:59.989')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('1753-01-01 00:00:00.000')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values('9999-12-31 23:59:59.997')
~~ROW COUNT: 1~~

INSERT INTO DATETIME_dt(a) values(NULL)
~~ROW COUNT: 1~~

SELECT * FROM DATETIME_dt;
~~START~~
datetime
2000-12-13 12:58:23.123
2000-02-28 23:59:59.99
2000-02-28 23:59:59.99
2000-02-28 23:59:59.99
2000-02-28 23:59:59.993
2000-02-28 23:59:59.993
2000-02-28 23:59:59.993
2000-02-28 23:59:59.997
2000-02-28 23:59:59.997
2000-02-28 23:59:59.997
2000-02-28 23:59:59.997
2000-02-29 00:00:00.0
1900-02-28 23:59:59.99
1753-01-01 00:00:00.0
9999-12-31 23:59:59.997
<NULL>
2000-12-13 12:58:23.123
1900-02-28 23:59:59.99
1900-02-28 23:59:59.99
1900-02-28 23:59:59.99
1900-02-28 23:59:59.993
1900-02-28 23:59:59.993
1900-02-28 23:59:59.993
1900-02-28 23:59:59.997
1900-02-28 23:59:59.997
1900-02-28 23:59:59.997
1900-02-28 23:59:59.997
1900-03-01 00:00:00.0
2000-02-28 23:59:59.99
1753-01-01 00:00:00.0
9999-12-31 23:59:59.997
<NULL>
~~END~~

DROP TABLE DATETIME_dt;

select convert(datetime, '2022-11-10 09:15:30.000');
~~START~~
datetime
2022-11-10 09:15:30.0
~~END~~

select convert(datetime, '2022-11-10 09:15:30.001');
~~START~~
datetime
2022-11-10 09:15:30.0
~~END~~

select convert(datetime, '2022-11-10 09:15:30.002');
~~START~~
datetime
2022-11-10 09:15:30.003
~~END~~

select convert(datetime, '2022-11-10 09:15:30.003');
~~START~~
datetime
2022-11-10 09:15:30.003
~~END~~

select convert(datetime, '2022-11-10 09:15:30.004');
~~START~~
datetime
2022-11-10 09:15:30.003
~~END~~

select convert(datetime, '2022-11-10 09:15:30.005');
~~START~~
datetime
2022-11-10 09:15:30.007
~~END~~

select convert(datetime, '2022-11-10 09:15:30.006');
~~START~~
datetime
2022-11-10 09:15:30.007
~~END~~

select convert(datetime, '2022-11-10 09:15:30.007');
~~START~~
datetime
2022-11-10 09:15:30.007
~~END~~

select convert(datetime, '2022-11-10 09:15:30.008');
~~START~~
datetime
2022-11-10 09:15:30.007
~~END~~

select convert(datetime, '2022-11-10 09:15:30.009');
~~START~~
datetime
2022-11-10 09:15:30.01
~~END~~

select convert(datetime, '2022-11-10 09:15:30.999');
~~START~~
datetime
2022-11-10 09:15:31.0
~~END~~


select convert(datetime, '2022-11-10 21:26:45.120');
~~START~~
datetime
2022-11-10 21:26:45.12
~~END~~

select convert(datetime, '2022-11-10 21:26:45.341');
~~START~~
datetime
2022-11-10 21:26:45.34
~~END~~

select convert(datetime, '2022-11-10 21:26:45.562');
~~START~~
datetime
2022-11-10 21:26:45.563
~~END~~

select convert(datetime, '2022-11-10 21:26:45.783');
~~START~~
datetime
2022-11-10 21:26:45.783
~~END~~

select convert(datetime, '2022-11-10 21:26:45.904');
~~START~~
datetime
2022-11-10 21:26:45.903
~~END~~

select convert(datetime, '2022-11-10 21:26:45.215');
~~START~~
datetime
2022-11-10 21:26:45.217
~~END~~

select convert(datetime, '2022-11-10 21:26:45.436');
~~START~~
datetime
2022-11-10 21:26:45.437
~~END~~

select convert(datetime, '2022-11-10 21:26:45.657');
~~START~~
datetime
2022-11-10 21:26:45.657
~~END~~

select convert(datetime, '2022-11-10 21:26:45.878');
~~START~~
datetime
2022-11-10 21:26:45.877
~~END~~

select convert(datetime, '2022-11-10 21:26:45.909');
~~START~~
datetime
2022-11-10 21:26:45.91
~~END~~


select convert(datetime, '2000-12-13 12:58:23.123');
~~START~~
datetime
2000-12-13 12:58:23.123
~~END~~

select convert(datetime, '2000-12-13 12:58:23.223');
~~START~~
datetime
2000-12-13 12:58:23.223
~~END~~

select convert(datetime, '2000-12-13 12:58:23.323');
~~START~~
datetime
2000-12-13 12:58:23.323
~~END~~

select convert(datetime, '2000-12-13 12:58:23.423');
~~START~~
datetime
2000-12-13 12:58:23.423
~~END~~

select convert(datetime, '2000-12-13 12:58:23.523');
~~START~~
datetime
2000-12-13 12:58:23.523
~~END~~

select convert(datetime, '2000-12-13 12:58:23.623');
~~START~~
datetime
2000-12-13 12:58:23.623
~~END~~

select convert(datetime, '2000-12-13 12:58:23.723');
~~START~~
datetime
2000-12-13 12:58:23.723
~~END~~

select convert(datetime, '2000-12-13 12:58:23.823');
~~START~~
datetime
2000-12-13 12:58:23.823
~~END~~

select convert(datetime, '2000-12-13 12:58:23.923');
~~START~~
datetime
2000-12-13 12:58:23.923
~~END~~

select convert(datetime, '2000-12-13 12:58:23.023');
~~START~~
datetime
2000-12-13 12:58:23.023
~~END~~


select convert(datetime, '1753-01-01 23:59:59.997');
~~START~~
datetime
1753-01-01 23:59:59.997
~~END~~

select convert(datetime, '1753-12-31 23:59:59.998');
~~START~~
datetime
1753-12-31 23:59:59.997
~~END~~

select convert(datetime, '1753-12-31 23:59:59.999');
~~START~~
datetime
1754-01-01 00:00:00.0
~~END~~

select convert(datetime, '9999-12-31 23:59:59.998');
~~START~~
datetime
9999-12-31 23:59:59.997
~~END~~

select convert(datetime, '9999-12-31 23:59:59.999');
~~START~~
datetime
~~ERROR (Code: 33557097)~~

~~ERROR (Message: The conversion of a varchar data type to a datetime data type resulted in an out-of-range value.)~~

select convert(datetime, '1752-12-31 23:59:59.997');
~~START~~
datetime
~~ERROR (Code: 33557097)~~

~~ERROR (Message: The conversion of a varchar data type to a datetime data type resulted in an out-of-range value.)~~

select convert(datetime, '0000-00-00 00:00:00.000');
~~START~~
datetime
~~ERROR (Code: 33557097)~~

~~ERROR (Message: The conversion of a varchar data type to a datetime data type resulted in an out-of-range value.)~~

select convert(datetime, NULL);
~~START~~
datetime
<NULL>
~~END~~


select convert(datetime, '1900-01-01 02:18:53.003')
~~START~~
datetime
1900-01-01 02:18:53.003
~~END~~

select convert(datetime, '1900-01-02 00:00:00.003')
~~START~~
datetime
1900-01-02 00:00:00.003
~~END~~

select convert(datetime, '1900-01-02 01:00:00.003')
~~START~~
datetime
1900-01-02 01:00:00.003
~~END~~

